Revit 2027 API
FabricationServiceSettings.AirFluidType Property
 A special fluid type for fabrication HVAC services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId AirFluidType { get; }
Public Shared ReadOnly Property AirFluidType As ElementId
	Get
public:
static property ElementId^ AirFluidType {
	ElementId^ get ();
}
static member AirFluidType : ElementId with get
Property Value
ElementId
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace